polls_app/app/models/response.rb

  def sibling_responses
    self.question.responses.where.not(id: self.id)
---
SELECT  "questions".* FROM "questions" INNER JOIN "answer_choices" ON "questions"."id" = "answer_choices"."question_id" WHERE "answer_choices"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]